logs/average_benchmark_20250710_021108/benchmark_runs/run_03/h2_100ms_1pct.log
=== HTTP/2 BENCHMARK RESULTS ===
=== NETWORK CONDITIONS ===
Timestamp: 2025-07-10 01:54:42
Delay: 100ms
Loss: 1%
Router IP: 172.30.0.254
Server IP: 172.30.0.2
Current qdisc configuration:
qdisc netem 1: root refcnt 9 limit 1000 delay 150ms loss 1%
qdisc tbf 10: parent 1:1 rate 600Mbit burst 4050b lat 400ms 

=== CONNECTION ESTABLISHMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 1000 total requests
spawning thread #1: 5 total client(s). 1000 total requests
spawning thread #2: 5 total client(s). 1000 total requests
spawning thread #3: 5 total client(s). 1000 total requests
spawning thread #4: 5 total client(s). 1000 total requests
spawning thread #5: 5 total client(s). 1000 total requests
spawning thread #6: 5 total client(s). 1000 total requests
spawning thread #7: 5 total client(s). 1000 total requests
spawning thread #8: 5 total client(s). 1000 total requests
spawning thread #9: 5 total client(s). 1000 total requests
spawning thread #10: 5 total client(s). 1000 total requests
spawning thread #11: 5 total client(s). 1000 total requests
spawning thread #12: 5 total client(s). 1000 total requests
spawning thread #13: 5 total client(s). 1000 total requests
spawning thread #14: 5 total client(s). 1000 total requests
spawning thread #15: 5 total client(s). 1000 total requests
spawning thread #16: 5 total client(s). 1000 total requests
spawning thread #17: 5 total client(s). 1000 total requests
spawning thread #18: 5 total client(s). 1000 total requests
spawning thread #19: 5 total client(s). 1000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 448.95ms, 44548.19 req/s, 12.94MB/s
requests: 20000 total, 20000 started, 20000 done, 20000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 20000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 5.81MB (6089629) total, 4.07MB (4264911) headers (space savings 27.71%), 1.14MB (1200000) data
                     min         max         mean         sd        +/- sd
time for request:    25.38ms    242.92ms    126.03ms     75.53ms    50.39%
time for connect:     2.53ms    121.70ms     64.29ms     36.41ms    52.00%
time to 1st byte:    28.05ms    361.47ms    194.43ms    119.75ms    38.00%
req/s           :     453.80     2832.97      882.08      671.30    91.00%
Waiting 5s for connections to stabilize...
=== MEASUREMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 9000 total requests
spawning thread #1: 5 total client(s). 9000 total requests
spawning thread #2: 5 total client(s). 9000 total requests
spawning thread #3: 5 total client(s). 9000 total requests
spawning thread #4: 5 total client(s). 9000 total requests
spawning thread #5: 5 total client(s). 9000 total requests
spawning thread #6: 5 total client(s). 9000 total requests
spawning thread #7: 5 total client(s). 9000 total requests
spawning thread #8: 5 total client(s). 9000 total requests
spawning thread #9: 5 total client(s). 9000 total requests
spawning thread #10: 5 total client(s). 9000 total requests
spawning thread #11: 5 total client(s). 9000 total requests
spawning thread #12: 5 total client(s). 9000 total requests
spawning thread #13: 5 total client(s). 9000 total requests
spawning thread #14: 5 total client(s). 9000 total requests
spawning thread #15: 5 total client(s). 9000 total requests
spawning thread #16: 5 total client(s). 9000 total requests
spawning thread #17: 5 total client(s). 9000 total requests
spawning thread #18: 5 total client(s). 9000 total requests
spawning thread #19: 5 total client(s). 9000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 14.34s, 12549.74 req/s, 3.65MB/s
requests: 180000 total, 180000 started, 180000 done, 180000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 180000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 52.32MB (54863990) total, 36.70MB (38479090) headers (space savings 27.60%), 10.30MB (10800000) data
                     min         max         mean         sd        +/- sd
time for request:      428us       1.07s    386.36ms    233.79ms    62.16%
time for connect:     4.82ms    108.54ms     55.72ms     26.39ms    59.00%
time to 1st byte:    31.66ms    766.85ms    372.58ms    233.05ms    54.00%
req/s           :     125.54      136.19      126.84        2.33    80.00%

=== BENCHMARK SUMMARY ===
Protocol: HTTP/2
Fair Comparison: Enabled
Warmup Requests: 20000
Measurement Requests: 180000
End Time: 2025-07-10 01:55:02
CSV Log: /logs/benchmark_20250710_015140/h2_100ms_1pct.csv